#!/usr/bin/env python
# -*- coding:utf-8 -*-

s = 'spam'

# --------------------     索引和分片     --------------------
# 索引 s[i] 获取指定偏移的元素
# 第一个元素偏移为0
# 最后一个元素偏移为-1
print('-' * 20, '    索引和分片    ', '-' * 20)
print('索引s[1]：\n\t%s' % s[1])
print('索引s[2]：\n\t%s' % s[2])
print('索引s[-2]：\n\t%s' % s[-2])
print('负数索引+字符串长度=索引位置！\n')
# 分片 s[i: j] 提取指定偏移的字符串
# 为半开半闭区间 [i, j)
print('分片s[:]：\n\t%s\n' % s[:])
print('分片s[1:]：\n\t%s' % s[1:])
print('分片s[0: 2]：\n\t%s' % s[0: 2])
print('分片s[: 3]：\n\t%s' % s[: 3])
print('分片s[: -1]：\n\t%s' % s[: -1])
print('分片s[0: -1]：\n\t%s' % s[0: -1])
# 步进索引 s[i: j: k] 在[i, j)之间，每隔k个元素索引一次
a = '1234567890'
print('步进a[1: 10: 2]：\n\t%s' % a[1: 10: 2])
print('步进a[0: 10: 3]：\n\t%s' % a[0: 10: 3])
