#!/usr/bin/env python
# -*- coding:utf-8 -*-

# * 参数-----------------------------------------------------------------------
print('-' * 30, '    * 参数    ', '-' * 30)
"""
* 参数可以收集任意数量的参数，并将其收集到一个新元组中
"""


def func(*args):
    print(args)


func()
func(1)
func(1, 2, 'a', {'name': 'Mike'})

# ** 参数----------------------------------------------------------------------
print('-' * 30, '    ** 参数    ', '-' * 30)
"""
** 参数也可以收集任意数量的参数，但是只对关键字参数有效（name=value）
"""


def func(**args):
    print(args)


func()
func(a=1, b=2)


# 混合使用两种参数-------------------------------------------------------------
print('-' * 30, '    混合使用两种参数    ', '-' * 30)


def func(x, *pargs, **kargs):
    print(x, pargs, kargs)


func(1, 2, 3, 4, a=1, b=2)
